; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v6)
             (pred_5 ?v3 ?v1)
             (pred_4 ?v13 ?v1)
             (pred_11 ?v12 ?v13 )
	     (pred_6 ?v13)
             (pred_1 ?v8)
             (pred_3 ?v3)
             (pred_12 ?v1)
             (pred_2 ?v13)
             (pred_10 ?v3)
             (pred_8 ?v13)
             (pred_7 ))



(:action op_1
:parameters (?v7 ?v10 ?v4 ?v9)
:precondition (and (pred_1 ?v7) (pred_1 ?v10) (pred_3 ?v4) (pred_12 ?v9)
          (pred_9 ?v7 ?v10) (pred_5 ?v4 ?v9)
                   (pred_4 ?v10 ?v9) (pred_6 ?v7) 
                   (pred_2 ?v10) (pred_10 ?v4))
:effect (and  (pred_8 ?v10) (not (pred_2 ?v10))))


(:action op_5
:parameters (?v7 ?v11)
:precondition (and (pred_1 ?v7) (pred_1 ?v11)
               (pred_6 ?v7) (pred_9 ?v7 ?v11) (pred_8 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_1 ?v7) (pred_3 ?v4) 
                  (pred_6 ?v7) (pred_11 ?v4 ?v7) (pred_7 ))
:effect (and (pred_10 ?v4)
   (not (pred_11 ?v4 ?v7)) (not (pred_7 ))))


(:action op_3
:parameters (?v7 ?v5 ?v2)
:precondition (and (pred_1 ?v7) (pred_3 ?v5) (pred_3 ?v2)
                  (pred_6 ?v7) (pred_10 ?v2) (pred_11 ?v5 ?v7))
:effect (and (pred_10 ?v5) (pred_11 ?v2 ?v7)
        (not (pred_10 ?v2)) (not (pred_11 ?v5 ?v7))))

(:action op_2
:parameters (?v7 ?v4)
:precondition (and (pred_1 ?v7) (pred_3 ?v4) 
                  (pred_6 ?v7) (pred_10 ?v4))
:effect (and (pred_7 ) (pred_11 ?v4 ?v7) (not (pred_10 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_28 obj_14 obj_30 obj_21 obj_31 obj_18 obj_22 obj_25 obj_07 obj_20 obj_12 obj_23 obj_06 obj_24 obj_19 obj_01 obj_29 obj_04 obj_03 obj_17 obj_05 obj_09 obj_11 obj_13
    obj_10 obj_27 obj_02
    obj_15 obj_08 obj_26
    )

    (:init
       (pred_7)

       (pred_1 obj_16)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_30)
       (pred_1 obj_21)
       (pred_1 obj_31)
       (pred_1 obj_18)
       (pred_1 obj_22)
       (pred_1 obj_25)
       (pred_1 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_23)
       (pred_1 obj_06)
       (pred_1 obj_24)
       (pred_1 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_29)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_12 obj_10)
       (pred_12 obj_27)
       (pred_12 obj_02)
       (pred_3 obj_15)
       (pred_3 obj_08)
       (pred_3 obj_26)

       (pred_9 obj_16 obj_31)
       (pred_9 obj_16 obj_28)
       (pred_9 obj_28 obj_18)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_28 obj_16)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_30 obj_21)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_30)
       (pred_9 obj_31 obj_20)
       (pred_9 obj_31 obj_18)
       (pred_9 obj_31 obj_16)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_18 obj_22)
       (pred_9 obj_18 obj_28)
       (pred_9 obj_18 obj_31)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_18)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_25 obj_07)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_25)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_12)
       (pred_9 obj_20 obj_31)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_23)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_12 obj_20)
       (pred_9 obj_23 obj_29)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_22)
       (pred_9 obj_23 obj_12)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_24)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_24 obj_03)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_24 obj_06)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_29 obj_23)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_24)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_11)
       (pred_2 obj_17)
       (pred_2 obj_28)
       (pred_2 obj_13)
       (pred_4  obj_17 obj_10)
       (pred_4  obj_28 obj_27)
       (pred_4  obj_13 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_14)
       (pred_8 obj_30)
       (pred_8 obj_21)
       (pred_8 obj_31)
       (pred_8 obj_18)
       (pred_8 obj_22)
       (pred_8 obj_25)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_23)
       (pred_8 obj_06)
       (pred_8 obj_24)
       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_8 obj_29)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_11)

       (pred_5  obj_15 obj_10)
       (pred_5  obj_08 obj_27)
       (pred_5  obj_26 obj_02)
       (pred_11 obj_15 obj_30)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_26 obj_11)
       (pred_6 obj_07)
    )

    (:goal (and
       (pred_11 obj_08 obj_23)
       (pred_11 obj_26 obj_31)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_5 obj_07 obj_25)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_25)
   goals met: 0 of 2
2. (op_5 obj_25 obj_06)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_06)
   goals met: 0 of 2
3. (op_5 obj_06 obj_23)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_23)
   goals met: 0 of 2
4. (op_5 obj_23 obj_29)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_29)
   goals met: 0 of 2
5. (op_5 obj_29 obj_01)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_4 obj_01 obj_08)
   deleted: (pred_11 obj_08 obj_01) (pred_7)
   added: (pred_10 obj_08)
   goals met: 0 of 2
7. (op_5 obj_01 obj_29)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_29)
   goals met: 0 of 2
8. (op_5 obj_29 obj_23)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_23)
   goals met: 0 of 2
9. (op_2 obj_23 obj_08)
   deleted: (pred_10 obj_08)
   added: (pred_7) (pred_11 obj_08 obj_23)
   goals met: 1 of 2
10. (op_5 obj_23 obj_29)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_29)
   goals met: 1 of 2
11. (op_5 obj_29 obj_09)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_09)
   goals met: 1 of 2
12. (op_5 obj_09 obj_11)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_11)
   goals met: 1 of 2
13. (op_4 obj_11 obj_26)
   deleted: (pred_11 obj_26 obj_11) (pred_7)
   added: (pred_10 obj_26)
   goals met: 1 of 2
14. (op_5 obj_11 obj_09)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_09)
   goals met: 1 of 2
15. (op_5 obj_09 obj_29)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_29)
   goals met: 1 of 2
16. (op_5 obj_29 obj_23)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_23)
   goals met: 1 of 2
17. (op_5 obj_23 obj_22)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_22)
   goals met: 1 of 2
18. (op_5 obj_22 obj_18)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_18)
   goals met: 1 of 2
19. (op_5 obj_18 obj_31)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_31)
   goals met: 1 of 2
20. (op_2 obj_31 obj_26)
   deleted: (pred_10 obj_26)
   added: (pred_7) (pred_11 obj_26 obj_31)
   goals met: 2 of 2
